# ReverseIterator Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
WireSizeSet..::..ReverseIterator Method
WireSizeSet Class See Also
---
Retrieve a backward moving iterator to the set.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual WireSizeSetIterator ReverseIterator()
```

Visual Basic
---
```text
Public Overridable Function ReverseIterator As WireSizeSetIterator
```

Visual C++
---
```text
public:
virtual WireSizeSetIterator^ ReverseIterator()
```

# ### Return Value
Returns a backward moving iterator to the set.
# See Also
WireSizeSet Class
Autodesk.Revit.DB.Electrical Namespace